##### Day Objectives:
        - Pandas
            - pandas dataframe

In [2]:
import numpy as np
import pandas as pd

##### pandas DataFrame:
        - it is mainly used for to create the 2-d dimensional array in the format of rows and columns(table)
        - pd.DataFrame(list,tuple,dict,numpy_array)

In [4]:
d={'name':['siri','giri'],
    'rno':[510,523],
     'branch':['CSE','ECE']}
df=pd.DataFrame(d)
df

   name  rno branch
0  siri  510    CSE
1  giri  523    ECE

In [5]:
df.columns

Index(['name', 'rno', 'branch'], dtype='object')

In [7]:
# To rename the single column name
df.rename(columns={'rno':'RNO'},inplace=True)
df

   name  RNO branch
0  siri  510    CSE
1  giri  523    ECE

In [8]:
# To rename the all the column names:
df.columns=['NAME','ROLL NO','BRANCH']
df

   NAME  ROLL NO BRANCH
0  siri      510    CSE
1  giri      523    ECE

In [10]:
df.rename(columns={'NAME':'Name','ROLL NO':'Rno'},inplace=True)
df

   Name  Rno BRANCH
0  siri  510    CSE
1  giri  523    ECE

In [12]:
# To rename the index names
df.index=['A','B']
df

   Name  Rno BRANCH
A  siri  510    CSE
B  giri  523    ECE

In [14]:
a=np.array([[1,2,3],[4,5,6]])
df1=pd.DataFrame(a)
df1

   0  1  2
0  1  2  3
1  4  5  6

In [15]:
df1.index=['x','y']
df1

   0  1  2
x  1  2  3
y  4  5  6

In [16]:
df1.columns=['a','b','c']
df1

   a  b  c
x  1  2  3
y  4  5  6

In [17]:
# To delete the all the row records?
df

   Name  Rno BRANCH
A  siri  510    CSE
B  giri  523    ECE

In [18]:
df.drop(df.index,inplace=True)
df

Empty DataFrame
Columns: [Name, Rno, BRANCH]
Index: []

In [20]:
# To delete the all the column names?
df.drop(df.columns,inplace=True,axis=1)
df

Empty DataFrame
Columns: []
Index: []

#### file input/output reading in pandas:
        - pd.read_csv('filename')

In [21]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__deprecated_num_index_names', '__dir__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [24]:
df2=pd.read_csv('data.csv')
df2

       Name  Rollno Branch  Java  python
0  srikanya     419    cse    45      78
1     deepu     560    cse    67      90
2    nethra     423    ece    67      24
3     akhil     234   mech    56      34
4   narmada     342  civil    89      90
5   krishna     232    ece    27      56
6    ganesh     121   mech    78      45
7      nani     463    ece    76      72
8    aaryan     367    cse    56      45
9     nandu     232    eee    55      49

In [25]:
# shape->it returns no of rows and columns from the dataframe
df2.shape

(10, 5)

In [26]:
# index->it returns index positions from the dataframe
df2.index

RangeIndex(start=0, stop=10, step=1)

In [27]:
# columns->it returns total column names from the dataframe
df2.columns

Index(['Name', 'Rollno', 'Branch', 'Java', 'python'], dtype='object')

In [29]:
df2.columns[1]

'Rollno'

In [30]:
df2.columns[4]

'python'

In [31]:
df2.columns[1:3]

Index(['Rollno', 'Branch'], dtype='object')

In [34]:
# sorting

In [35]:
df2

       Name  Rollno Branch  Java  python
0  srikanya     419    cse    45      78
1     deepu     560    cse    67      90
2    nethra     423    ece    67      24
3     akhil     234   mech    56      34
4   narmada     342  civil    89      90
5   krishna     232    ece    27      56
6    ganesh     121   mech    78      45
7      nani     463    ece    76      72
8    aaryan     367    cse    56      45
9     nandu     232    eee    55      49

In [37]:
# To print the student names in order?
df2.sort_values('Name')

       Name  Rollno Branch  Java  python
8    aaryan     367    cse    56      45
3     akhil     234   mech    56      34
1     deepu     560    cse    67      90
6    ganesh     121   mech    78      45
5   krishna     232    ece    27      56
9     nandu     232    eee    55      49
7      nani     463    ece    76      72
4   narmada     342  civil    89      90
2    nethra     423    ece    67      24
0  srikanya     419    cse    45      78

In [39]:
df2.sort_values('Name',ascending=False)

       Name  Rollno Branch  Java  python
0  srikanya     419    cse    45      78
2    nethra     423    ece    67      24
4   narmada     342  civil    89      90
7      nani     463    ece    76      72
9     nandu     232    eee    55      49
5   krishna     232    ece    27      56
6    ganesh     121   mech    78      45
1     deepu     560    cse    67      90
3     akhil     234   mech    56      34
8    aaryan     367    cse    56      45

In [40]:
df2.sort_values('Name',ascending=True)

       Name  Rollno Branch  Java  python
8    aaryan     367    cse    56      45
3     akhil     234   mech    56      34
1     deepu     560    cse    67      90
6    ganesh     121   mech    78      45
5   krishna     232    ece    27      56
9     nandu     232    eee    55      49
7      nani     463    ece    76      72
4   narmada     342  civil    89      90
2    nethra     423    ece    67      24
0  srikanya     419    cse    45      78

In [42]:
df2.sort_values('Java',ascending=False)

       Name  Rollno Branch  Java  python
4   narmada     342  civil    89      90
6    ganesh     121   mech    78      45
7      nani     463    ece    76      72
1     deepu     560    cse    67      90
2    nethra     423    ece    67      24
3     akhil     234   mech    56      34
8    aaryan     367    cse    56      45
9     nandu     232    eee    55      49
0  srikanya     419    cse    45      78
5   krishna     232    ece    27      56

In [45]:
df2[['Name']]

       Name
0  srikanya
1     deepu
2    nethra
3     akhil
4   narmada
5   krishna
6    ganesh
7      nani
8    aaryan
9     nandu

In [46]:
df2[['Java','python']]

   Java  python
0    45      78
1    67      90
2    67      24
3    56      34
4    89      90
5    27      56
6    78      45
7    76      72
8    56      45
9    55      49

In [49]:
df2[['Java']].max()

Java    89
dtype: int64

In [50]:
df2[['Java','python']].max()

Java      89
python    90
dtype: int64

In [51]:
df2[['Java','python']].min()

Java      27
python    24
dtype: int64

In [52]:
df2[['Java','python']].sum()

Java      616
python    583
dtype: int64

In [57]:
# to add two subject marks..
df2['Total']=df2['Java']+df2['python']
df2

       Name  Rollno Branch  Java  python  Total
0  srikanya     419    cse    45      78    123
1     deepu     560    cse    67      90    157
2    nethra     423    ece    67      24     91
3     akhil     234   mech    56      34     90
4   narmada     342  civil    89      90    179
5   krishna     232    ece    27      56     83
6    ganesh     121   mech    78      45    123
7      nani     463    ece    76      72    148
8    aaryan     367    cse    56      45    101
9     nandu     232    eee    55      49    104